
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>死亡问答 · Android架构养成记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    性能优化
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../性能优化/启动速度与执行效率优化.html">
            
                <a href="../性能优化/启动速度与执行效率优化.html">
            
                    
                    启动速度与执行效率优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../性能优化/布局检测与优化.html">
            
                <a href="../性能优化/布局检测与优化.html">
            
                    
                    布局检测与优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../性能优化/内存优化.html">
            
                <a href="../性能优化/内存优化.html">
            
                    
                    内存优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../性能优化/耗电优化.html">
            
                <a href="../性能优化/耗电优化.html">
            
                    
                    耗电优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../性能优化/网络传输与数据存储优化.html">
            
                <a href="../性能优化/网络传输与数据存储优化.html">
            
                    
                    网络传输与数据存储优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="../性能优化/APK大小优化.html">
            
                <a href="../性能优化/APK大小优化.html">
            
                    
                    APK大小优化
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="../性能优化/屏幕适配.html">
            
                <a href="../性能优化/屏幕适配.html">
            
                    
                    屏幕适配
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    奇妙的framework源码
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                    Binder
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    奇淫巧计
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../奇淫巧计/文件目录.html">
            
                <a href="../奇淫巧计/文件目录.html">
            
                    
                    文件目录
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../奇淫巧计/ADB.html">
            
                <a href="../奇淫巧计/ADB.html">
            
                    
                    ADB
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    业务
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="死亡问答.html">
            
                <a href="死亡问答.html">
            
                    
                    死亡问答
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    开源框架
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" >
            
                <span>
            
                    
                    注入框架
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" >
            
                <span>
            
                    
                    1.IoC，DI 理解它是什么了吗？
2.如何玩转自定义注解?
3.手写实现布局、控件、事件的注入框架
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >死亡问答</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6B7B;&#x4EA1;&#x95EE;&#x7B54;">&#x6B7B;&#x4EA1;&#x95EE;&#x7B54;</h1>
<h2 id="&#x4E1A;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#x5982;&#x4F55;&#x4FDD;&#x969C;&#xFF1F;">&#x4E1A;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#x5982;&#x4F55;&#x4FDD;&#x969C;&#xFF1F;</h2>
<ul>
<li>&#x6570;&#x636E;&#x91C7;&#x96C6; + &#x62A5;&#x8B66;</li>
<li>&#x9700;&#x8981;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x6D41;&#x7A0B;&#x4E0E;&#x6838;&#x5FC3;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x57CB;&#x70B9;&#x76D1;&#x63A7;&#xFF0C;</li>
<li>&#x540C;&#x65F6;&#x8FD8;&#x9700;&#x77E5;&#x9053;&#x6BCF;&#x4E00;&#x6B65;&#x53D1;&#x751F;&#x4E86;&#x591A;&#x5C11;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;
&#x7684;&#x8F6C;&#x6362;&#x7387;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x754C;&#x9762;&#x7684;&#x8F6C;&#x6362;&#x7387;</li>
<li>&#x7ED3;&#x5408;&#x5927;&#x76D8;&#xFF0C;&#x5982;&#x679C;&#x8F6C;&#x6362;&#x7387;&#x4F4E;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#xFF0C;&#x8FDB;&#x884C;&#x62A5;&#x8B66;</li>
<li>&#x5F02;&#x5E38;&#x76D1;&#x63A7; + &#x5355;&#x70B9;&#x8FFD;&#x67E5;</li>
<li>&#x515C;&#x5E95;&#x7B56;&#x7565;</li>
</ul>
<p>&#x79FB;&#x52A8;&#x7AEF;&#x4E1A;&#x52A1;&#x9AD8;&#x53EF;&#x7528;&#x5B83;&#x4FA7;&#x91CD;&#x4E8E;&#x7528;&#x6237;&#x529F;&#x80FD;&#x5B8C;&#x6574;&#x53EF;&#x7528;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x7EBF;&#x4E0A;&#x4E00;&#x4E9B;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x4ED6;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x5D29;&#x6E83;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5462;&#xFF0C;&#x53EA;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x529F;&#x80FD;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x6D41;&#x7A0B;&#x3001;&#x6838;&#x5FC3;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x57CB;&#x70B9;&#x76D1;&#x63A7;&#xFF0C;&#x6765;&#x8BA1;&#x7B97;&#x6BCF;&#x4E00;&#x6B65;&#x5B83;&#x771F;&#x5B9E;&#x7684;&#x8F6C;&#x6362;&#x7387;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x540C;&#x65F6;&#x5462;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5728;&#x6BCF;&#x4E00;&#x6B65;&#x5230;&#x5E95;&#x53D1;&#x751F;&#x4E86;&#x591A;&#x5C11;&#x5F02;&#x5E38;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x8F6C;&#x6362;&#x7387;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x754C;&#x9762;&#x7684;&#x8F6C;&#x6362;&#x7387;&#xFF0C;&#x6709;&#x4E86;&#x5927;&#x76D8;&#x7684;&#x6570;&#x636E;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x8F6C;&#x6362;&#x7387;&#x6216;&#x8005;&#x662F;&#x67D0;&#x4E9B;&#x76D1;&#x63A7;&#x7684;&#x6210;&#x529F;&#x7387;&#x4F4E;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#xFF0C;&#x90A3;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x51FA;&#x73B0;&#x4E86;&#x7EBF;&#x4E0A;&#x5F02;&#x5E38;&#xFF0C;&#x7ED3;&#x5408;&#x4E86;&#x76F8;&#x5E94;&#x7684;&#x62A5;&#x8B66;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x7528;&#x6237;&#x6765;&#x53CD;&#x9988;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x4E1A;&#x52A1;&#x7A33;&#x5B9A;&#x6027;&#x4FDD;&#x969C;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x540C;&#x65F6;&#x5462;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x5F53;&#x4E2D;&#x6216;&#x4EE3;&#x7801;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B; catch&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x6355;&#x83B7;&#x4F4F;&#x4E86;&#x5F02;&#x5E38;&#xFF0C;&#x8BA9;&#x7A0B;&#x5E8F;&#x4E0D;&#x5D29;&#x6E83;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x7A0B;&#x5E8F;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x5D29;&#x6E83;&#xFF0C;&#x5F53;&#x65F6;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x8FD9;&#x4E9B;&#x88AB; catch &#x7684;&#x5F02;&#x5E38;&#x6211;&#x4EEC;&#x4E5F;&#x9700;&#x8981;&#x4E0A;&#x62A5;&#x4E0A;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x77E5;&#x9053;&#x7528;&#x6237;&#x5230;&#x5E95;&#x51FA;&#x73B0;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x5F02;&#x5E38;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7EBF;&#x4E0A;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5355;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x767B;&#x5F55;&#x4E00;&#x76F4;&#x8FDB;&#x4E0D;&#x53BB;&#xFF0C;&#x8FD9;&#x79CD;&#x5C31;&#x5C5E;&#x4E8E;&#x5355;&#x70B9;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x662F;&#x65E0;&#x6CD5;&#x627E;&#x51FA;&#x5176;&#x548C;&#x5176;&#x5B83;&#x95EE;&#x9898;&#x7684;&#x5171;&#x6027;&#x4E4B;&#x5904;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5462;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x627E;&#x5230;&#x5B83;&#x5BF9;&#x5E94;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;
&#x6700;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F;&#x4E86;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x91C7;&#x53D6;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x63AA;&#x65BD;&#x8FDB;&#x884C;&#x5FEB;&#x901F;&#x6B62;&#x635F;&#x3002;</p>
<h2 id="&#x5982;&#x679C;&#x53D1;&#x751F;&#x4E86;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x600E;&#x4E48;&#x5FEB;&#x901F;&#x6B62;&#x635F;&#xFF1F;">&#x5982;&#x679C;&#x53D1;&#x751F;&#x4E86;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x600E;&#x4E48;&#x5FEB;&#x901F;&#x6B62;&#x635F;&#xFF1F;</h2>
<ul>
<li>&#x529F;&#x80FD;&#x5F00;&#x5173;</li>
<li>&#x7EDF;&#x8DF3;&#x4E2D;&#x5FC3;</li>
<li>&#x52A8;&#x6001;&#x4FEE;&#x590D;&#xFF1A;&#x70ED;&#x4FEE;&#x590D;&#x3001;&#x8D44;&#x6E90;&#x5305;&#x66F4;&#x65B0;</li>
<li>&#x81EA;&#x4E3B;&#x4FEE;&#x590D;&#xFF1A;&#x5B89;&#x5168;&#x6A21;&#x5F0F;</li>
</ul>
<p>&#x9996;&#x5148;&#xFF0C;&#x9700;&#x8981;&#x8BA9; App &#x5177;&#x5907;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x8981;&#x4E0A;&#x7EBF;&#x7684;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x8981;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x5173;&#xFF0C;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x4E2D;&#x5FC3;&#x4E0B;&#x53D1;&#x7684;&#x5F00;&#x5173;&#x5462;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x8981;&#x663E;&#x793A;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x5165;&#x53E3;&#x3002;&#x5982;&#x679C;&#x6709;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x7D27;&#x6025;&#x95ED;&#x65B0;&#x529F;&#x80FD;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x8FD9;&#x4E2A; App &#x5904;&#x4E8E;&#x53EF;&#x63A7;&#x7684;&#x72B6;&#x6001;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9; App &#x8BBE;&#x7ACB;&#x8DEF;&#x7531;&#x8DF3;&#x8F6C;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x754C;&#x9762;&#x8DF3;&#x8F6C;&#x90FD;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x6765;&#x5206;&#x53D1;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5339;&#x914D;&#x5230;&#x9700;&#x8981;&#x8DF3;&#x8F6C;&#x5230;&#x6709; bug &#x7684;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x8DF3;&#x8F6C;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x8DF3;&#x8F6C;&#x5230;&#x7EDF;&#x4E00;&#x7684;&#x5F02;&#x5E38;&#x6B63;&#x5904;&#x7406;&#x4E2D;&#x7684;&#x754C;&#x9762;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x90FD;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x901A;&#x8FC7;&#x70ED;&#x4FEE;&#x590D;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x52A8;&#x6001;&#x4FEE;&#x590D;&#xFF0C;&#x76EE;&#x524D;&#x70ED;&#x4FEE;&#x590D;&#x7684;&#x65B9;&#x6848;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4F4E;&#x6210;&#x672C;&#x5730;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x6DFB;&#x52A0;&#x70ED;&#x4FEE;&#x590D;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E9B;&#x529F;&#x80FD;&#x662F;&#x7531; RN &#x6216; WeeX &#x6765;&#x5B9E;&#x73B0;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x65B0;&#x8D44;&#x6E90;&#x5305;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x66F4;&#x65B0;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x5982;&#x679C;&#x90FD;&#x4E0D;&#x53EF;&#x4EE5;&#x7684;&#x8BDD;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x81EA;&#x5DF1;&#x53BB;&#x7ED9;&#x5E94;&#x7528;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x81EA;&#x4E3B;&#x4FEE;&#x590D;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5982;&#x679C; App &#x542F;&#x52A8;&#x591A;&#x6B21;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x6E05;&#x7A7A;&#x6240;&#x6709;&#x7684;&#x7F13;&#x5B58;&#x6570;&#x636E;&#xFF0C;&#x5C06; App&#x91CD;&#x7F6E;&#x5230;&#x5B89;&#x88C5;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5230;&#x4E86;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x7B49;&#x5462;&#xFF0C;&#x53EF;&#x4EE5;&#x963B;&#x585E;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x6B64;&#x65F6;&#x4E00;&#x5B9A;&#x8981;&#x7B49; App&#x70ED;&#x4FEE;&#x590D;&#x6210;&#x529F;&#x4E4B;&#x540E;&#x624D;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x8FDB;&#x5165;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"死亡问答","level":"1.5.1","depth":2,"next":{"title":"开源框架","level":"1.6","depth":1,"ref":"","articles":[{"title":"注入框架","level":"1.6.1","depth":2,"ref":"","articles":[]},{"title":"1.IoC，DI 理解它是什么了吗？\n2.如何玩转自定义注解?\n3.手写实现布局、控件、事件的注入框架","level":"1.6.2","depth":2,"ref":"","articles":[]}]},"previous":{"title":"业务","level":"1.5","depth":1,"ref":"","articles":[{"title":"死亡问答","level":"1.5.1","depth":2,"path":"业务/死亡问答.md","ref":"业务/死亡问答.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["expandable-chapters","splitter","code"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Android架构养成记","language":"zh-hans","gitbook":"*","description":"android全栈技术"},"file":{"path":"业务/死亡问答.md","mtime":"2020-09-22T10:53:21.751Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-22T11:45:05.507Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

